Конфигурация/src/BusinessProcesses/ОбработкаВедомостиОценок/ОбработкаВедомостиОценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ОбработкаВедомостиОценок</name>
  <task>Task.ЗадачаПользователя</task>
  <attributes>
    <name>Ведомость</name>
    <type>
      <types>DocumentRef.ВедомостьОценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Конфигурация/src/BusinessProcesses/ОбработкаВедомостиОценок/ObjectModule.bsl
Процедура ПроверитьВедомостьПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	
	Проверена = Истина;

	Если НЕ ПустаяСтрока(СокрЛП(Строка(Задача.КомментарийИсполнителя))) Тогда
		Комментарий = Задача.КомментарийИсполнителя;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВедомостьПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл

		ФормируемаяЗадача.Исполнитель = Ответственный;
		ФормируемаяЗадача.Наименование = "Проверить ведомость оценок";
		ФормируемаяЗадача.ОписаниеЗадачи = "Проверить ведомость оценок";

		Если ЗначениеЗаполнено(Ведомость) Тогда
			ФормируемаяЗадача.ОписаниеЗадачи = "Проверить ведомость оценок: " + Строка(Ведомость);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры
